w4d1/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Harry Potter and the Order of the Phoenix"], ["author", "J.K. Rowling"], ["created_at", "2016-07-27 17:04:33.390634"], ["updated_at", "2016-07-27 17:04:33.390634"]]
---
  def create
    book = Book.new(book_params)
    if book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    book = Book.find(id: params[:id])
    book.destroy